Repository: tomoki20162023/TodoistAPI_JP
Catalog: translation_project/translation_project-omegat.tmx
Source language: en_us
Languages: ja

source: API endpoints accept GET arguments as url-encoded values.
ja: APIエンドポイントは URLエンコードされた 値としてGETの引数を受理します。

source: Accept an invitation
ja: 招待を了承する

source: Accept an invitation to join a shared project.
ja: 共有プロジェクトに参加するために招待を受ける。

source: Accept invitation
ja: 招待を了承する

source: Activity
ja: 活動

source: Activity log is only available for Todoist Premium.
ja: 活動履歴はTodoistプレミアムのみご利用いただけます。

source: Add a label
ja: ラベルを追加する

source: Add a new project
ja: 新しいプロジェクトを追加する

source: Add a new section to a project.
ja: プロジェクトに新しいセクションを追加する。

source: Add a new task to a project.
ja: プロジェクトに新しいタスクを追加する。

source: Add a note
ja: ノートを追加する

source: Add a section
ja: セクションを追加する

source: Add an item
ja: アイテムを追加する

source: Add two new tasks
ja: 2つの新しいタスクを追加する

source: An example item object
ja: アイテムオブジェクトの例

source: An example label object
ja: ラベルオブジェクトの例

source: An example of quick add task:
ja: タスクを素早く追加する例：

source: An example project note object
ja: プロジェクトノートオブジェクトの例

source: An example project object
ja: プロジェクトのオブジェクトとしての例

source: An example task note object
ja: ノートオブジェクトの例

source: An example user object
ja: ユーザオブジェクトの例

source: An example user settings object
ja: ユーザ設定オブジェクトの例

source: Archive a section
ja: セクションをアーカイブに入れる

source: Archive a section and all its descendants tasks.
ja: セクションと全ての下位タスクをアーカイブに入れる。

source: Archive a task and all its descendants.
ja: タスクおよび全ての下位タスクをアーカイブする。

source: Archive item
ja: アイテムをアーカイブする

source: Authenticated request and response examples
ja: 認証されたリクエストとレスポンスの例

source: Authorization
ja: 認証

source: Backups
ja: バックアップ

source: Batching commands
ja: コマンドのバッチ処理

source: Batching multiple commands
ja: 複数のコマンドをバッチ処理する

source: Brand usage
ja: ブランドの利用法

source: Business
ja: ビジネス

source: By using the Todoist marks you agree to properly follow the above brand guidelines as well as our Terms of Service.
ja: By using the Todoist marks you agree to properly follow the above brand guidelines as well as our 利用規約.

source: Changes
ja: 変更

source: Close item
ja: アイテムを閉じる

source: Collaborator states
ja: 協力者の状態

source: Collaborators
ja: 協力者

source: Colors
ja: 色

source: Comment object sample
ja: コメントオブジェクトの例

source: Comments
ja: コメント

source: Complete a recurring task
ja: 繰り返しタスクを完了する

source: Complete a task and all its descendants.
ja: タスクと全ての下位タスクを完了する。

source: Complete item
ja: アイテムを完了する

source: Configuration
ja: 構成

source: Create a new comment
ja: 新しいコメントを作成

source: Create a new label
ja: 新しいラベルを作成する

source: Create a new project
ja: 新しいプロジェクトを作成する

source: Create a new section
ja: 新しいセクションを作成する

source: Create a new task
ja: 新しいタスクを作成する

source: Creates a new comment on a project or task and returns its object.
ja: プロジェクトかタスクに新しいコメントを作成し、そのオブジェクトを返す。

source: Creates a new label and returns its object as JSON.
ja: 新しいラベルを作成し、JSONとしてオブジェクトを返す。

source: Defines the position of the section among all the sections in the project
ja: プロジェクト内の全セクション間のセクションの位置を定義する

source: Delete a collaborator
ja: 協力者を削除する

source: Delete a comment
ja: コメントを削除する

source: Delete a label
ja: ラベルを削除する

source: Delete a project
ja: プロジェクトを削除する

source: Delete a reminder
ja: リマインダーを削除する

source: Delete a reminder from the user account related to the API credentials.
ja: API資格情報を連携したユーザーアカウントからリマインダーを削除する。

source: Delete a section
ja: セクションを削除する

source: Delete a task
ja: タスクを削除する

source: Delete a task and all its descendants
ja: タスクおよびすべての下位タスクを削除する

source: Delete an existing user
ja: 既存のユーザを削除する

source: Delete an invitation
ja: 招待状を削除する

source: Delete an invitation to join a shared project.
ja: 共有プロジェクトに参加するための招待状を削除する。

source: Delete an uploaded file.
ja: アップロードしたファイルを削除する

source: Delete item
ja: アイテムを削除する

source: Delete upload
ja: アップロードしたものを削除する

source: Deletes a comment and returns an empty body with a HTTP status code 204.
ja: コメントを削除して、空の本体とHTTPステータスコード204を返す。

source: Description
ja: 説明

source: Download the backup
ja: バックアップをダウンロードする

source: Due dates
ja: 期日

source: Emails
ja: eメール

source: Event JSON Object
ja: イベントのJSONオブジェクト

source: Event Name
ja: イベント名

source: Events
ja: イベント

source: Every endpoint requires an authorization header with the appropriate Bearer $token that holds the Todoist personal API token or OAuth API token with full permission scope.
ja: 全てのエンドポイント requires an 認証ヘッダー with 適切な Bearer $token that holds the Todoist personal API token もしくは OAuth API token with 全権限範囲.

source: Filters
ja: フィルター

source: Get a comment
ja: コメントを取得する

source: Get a label
ja: ラベルを取得する

source: Get a project
ja: プロジェクトを取得する

source: Get a single section
ja: 1つのセクションを取得する

source: Get active tasks
ja: 実行中のタスクを取得する

source: Get all collaborators
ja: 全ての協力者を取得する

source: Get all collaborators of a shared project
ja: 共有プロジェクト上で全ての協力者を取得する

source: Get all comments
ja: 全てのコメントを取得

source: Get all labels
ja: 全てのラベルを取得する

source: Get all projects
ja: 全てのプロジェクトを取得する

source: Get all sections
ja: 全てのセクションを取得する

source: Get all user’s uploads.
ja: 全てのユーザーのアップロードしたものを取得する。

source: Get an active task
ja: 実行中のタスクを取得する

source: Get backups
ja: バックアップを取得する

source: Get or create
ja: 取得または作成する

source: Get project sections
ja: プロジェクトのセクションを取得する

source: Get uploads
ja: アップロードしたものを取得する

source: Getting started
ja: 始めに

source: Header Name
ja: ヘッダー名

source: Hexadecimal
ja: 16進数

source: If you plan to utilize Todoist’s logo or branding in the visual design of your application or website, please adhere to Todoist’s brand guidelines.
ja: If you plan to utilize Todoist’s logo or branding in the visual design of your application or website, please adhere to Todoistのブランドガイドライン.

source: Important Considerations
ja: 重要な考慮点

source: In addition, please take note of the following:
ja: 加えて、以下のことに注意してください：

source: In the Getting started section we will try to present to you the Todoist API, in the simplest possible way, by using real examples, based on common tasks that many users want to accomplish.
ja: 始めにの節で、みなさんにTodoist APIを示します。できるだけ簡単な方法で、例を使いながら、多くのユーザが達成したいであろう共通のタスクを基にして。

source: Items
ja: アイテム

source: JSON body parameters
ja: JSON本体のパラメータ

source: Label object sample
ja: ラベルオブジェクトの例

source: Labels
ja: ラベル

source: Limits
ja: 制限事項

source: Live notifications
ja: ライブ通知

source: Migration guide
ja: 移行ガイド

source: Miscellaneous
ja: 色々なもの

source: Move a section
ja: セクションを移動する

source: Move an item
ja: アイテムを移動する。

source: Move section to a different location.
ja: 異なる場所にセクションを移動する。

source: Move task to a different location.
ja: 違う場所にタスクを移動する。

source: Note that we’re using $token on all of our curl examples, so you can define a temporary environment variable containing your token and easily copy & paste curl commands into your terminal.
ja: Note that we’re using $token on all of our curl examples, so you can define 一時的な環境変数 containing 自身の token and easily コピペ curl コマンド into 端末.

source: Notes
ja: ノート

source: Overview
ja: 概要

source: Parameter
ja: パラメータ

source: Parameters
ja: パラメータ一覧

source: Processing Timeouts
ja: 処理のタイムアウト

source: Project Notes
ja: プロジェクトノート

source: Projects
ja: プロジェクト

source: Properties
ja: 属性

source: Property
ja: 属性

source: Quick add task
ja: タスクを素早くに追加する

source: Reject an invitation
ja: 招待を断る

source: Reject an invitation to join a shared project.
ja: 共有プロジェクトに参加するための招待を断る。

source: Reminders
ja: リマインダー

source: Reminders are only available for Todoist Premium users.
ja: リマインダーはTodoistプレミアムユーザ限定の機能です。

source: Remove an user from a shared project.
ja: 共有プロジェクトからユーザーを削除する。

source: Reopen a task
ja: タスクを再開する

source: Reorder sections
ja: セクションを並べ替える

source: Request Header
ja: リクエストヘッダー

source: Requests per Minute
ja: 毎分のリクエスト数

source: Required
ja: 要求

source: Returns JSON-encoded array of all comments for a given task_id or project_id.
ja: task_id または project_id で指定されたすべてのコメントをJSONエンコードされた配列として返す。

source: Returns a JSON-encoded array containing all user labels
ja: 全ユーザのラベルを含むJSONエンコードされた配列を返す。

source: Returns a comment by id
ja: idでコメントを返す

source: Scheme
ja: スキーム

source: Section object example
ja: セクションオブジェクトの例

source: Sections
ja: セクション

source: Send invitation
ja: 招待状を送る

source: Share a project
ja: プロジェクトを共有する

source: Share a project with another user.
ja: 他のユーザのプロジェクトを共有する。

source: Sharing
ja: 共有

source: Some objects (like projects, labels, and filters) may have colors defined by an id.
ja: Some オブジェクト (プロジェクト、ラベル、そしてフィルターのような) may have colors defined by an id.

source: Status code
ja: ステータスコード

source: Summary of contents
ja: 要約

source: Sync
ja: 同期

source: Task object sample
ja: タスクオブジェクトの例

source: Tasks
ja: タスク

source: Templates
ja: テンプレート

source: Thanks for using Todoist’s API to build an application!
ja: アプリを構築するのにTodoistのAPIを使ってくれてありがとう！

source: The due date of the reminder.
ja: リマインダーの期限。

source: The exception to this rule is any of the upload endpoints which have a limit of 100 MiB.
ja: このルールの例外はすべての アップロード エンドポイントで、100MiBの制限となっている。

source: The order of section.
ja: セクションの順序。

source: The table below shows the ids for any of these colors.
ja: 下の表は全ての色とIDを表している。

source: There are processing timeouts associated with each endpoint and these vary depending on the type of action being performed.
ja: 各エンドポイントには処理のタイムアウトがあり、実行されるアクションの種類に応じて変わります。

source: There is currently a 1MiB http request body limit on POST requests.
ja: 現在、POSTリクエストに対し、HTTPリクエスト本体の1MiB制限がある。

source: This is the official documentation for Todoist REST API.
ja: こちらはTodoist REST APIの非公式文書となっております。（ここの翻訳はGitHubに載せている限り意図的に変えたままになると思います）

source: This is the official documentation for Todoist Sync API.
ja: これはTodoist Sync APIの非公式ドキュメントです。（意図的に非公式としています。GitHubに載せている間はこのままになると思います）

source: URL schemes
ja: URLスキーム

source: Unarchive a section
ja: セクションをアーカイブから出す

source: Unarchive item
ja: アイテムを書庫から取り出す

source: Uncomplete item
ja: アイテムを未完了に戻す

source: Update a comment
ja: コメントを更新する

source: Update a label
ja: ラベルを更新する

source: Update a note
ja: ノートを更新する

source: Update a project
ja: プロジェクトを更新する

source: Update a reminder from the user account related to the API credentials.
ja: API資格情報と連携したユーザーアカウントからリマインダーを更新する。

source: Update a section
ja: セクションを更新する

source: Update a task
ja: タスクを更新する

source: Update karma goals
ja: カルマ目標数を更新する

source: Update notification settings
ja: 通知設定を更新する

source: Update one or more user settings.
ja: 1つ以上のユーザ設定を更新する

source: Update the content and due date of a task
ja: タスクの期日と内容を更新する

source: Update the karma goals of the user.
ja: ユーザのカルマ目標数を更新する。

source: Update the user’s notification settings.
ja: ユーザの通知設定を更新する。

source: Update user settings
ja: ユーザ設定を更新する

source: Update user’s properties
ja: ユーザ属性を更新する

source: Updates a comment and returns an empty body with a HTTP status code 204.
ja: コメントを更新して、空の本体とHTTPステータスコード204を返す。

source: Updates section attributes.
ja: セクションの属性を更新する。

source: Updates task attributes.
ja: タスクの属性を更新する。

source: Upload a file
ja: ファイルをアップロードする

source: Uploads
ja: アップロード

source: User
ja: ユーザ

source: User settings
ja: ユーザ設定

source: User-Agent
ja: ユーザーエージェントUser-Agent

source: Value
ja: 値

source: Views
ja: ビュー

source: Webhooks
ja: ウェブフック

source: You can make a total of 50 requests per minute per user when using the REST API.
ja: REST APIを使うときは、各ユーザが１分当たり50リクエストまでとなっています。

source: “Todoist” cannot be the first word in your application’s name.
ja: あなた方のアプリ名に“Todoist”を最初の一語として使わないようにしてください。
